IRP/src/Catalogs/Companies/Companies.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Companies</name>
  <attributes>
    <name>Country</name>
    <type>
      <types>CatalogRef.Countries</types>
    </type>
  </attributes>
  <attributes>
    <name>MainCompany</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Partner</name>
    <type>
      <types>CatalogRef.Partners</types>
    </type>
  </attributes>
  <attributes>
    <name>Type</name>
    <type>
      <types>CatalogRef.CompanyTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Our</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Currencies</name>
    <attributes>
      <name>MovementType</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

IRP/src/Enums/CurrencyType/CurrencyType.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CurrencyType</name>
  <enumValues>
    <name>Reporting</name>
  </enumValues>
  <enumValues>
    <name>Legal</name>
  </enumValues>
  <enumValues>
    <name>Agreement</name>
  </enumValues>
  <enumValues>
    <name>Budgeting</name>
  </enumValues>
</mdclass:Enum>

IRP/src/Catalogs/Partners/Partners.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Partners</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Customer</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Vendor</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Employee</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Opponent</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ManagerSegment</name>
    <type>
      <types>CatalogRef.PartnerSegments</types>
    </type>
  </attributes>
  <attributes>
    <name>ShipmentConfirmationsBeforeSalesInvoice</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>GoodsReceiptBeforePurchaseInvoice</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AddAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/Companies/ManagerModule.bsl
Procedure ChoiceDataGetProcessing(ChoiceData, Parameters, StandardProcessing)
	
	If TypeOf(Parameters) <> Type("Structure")
		Or Not ValueIsFilled(Parameters.SearchString)
		Or Not Parameters.Filter.Property("AdditionalParameters") Then
		Return;
	EndIf;
	
	StandardProcessing = False;
	
	QueryTable = GetChoiseDataTable(Parameters);
	ChoiceData = New ValueList();
	For Each Row In QueryTable Do
		ChoiceData.Add(Row.Ref, Row.Presentation);
	EndDo;
EndProcedure

Function GetChoiseDataTable(Parameters) Export
	
	QueryBuilderText =
		"SELECT ALLOWED TOP 50
		|	Table.Ref AS Ref,
		|	Table.Presentation
		|FROM
		|	Catalog.Companies AS Table
		|WHERE
		|	Table.Description_en LIKE ""%%"" + &SearchString + ""%%""
		|	AND CASE
		|			WHEN &FilterByPartnerHierarchy
		|				THEN Table.Ref IN (&CompaniesByPartnerHierarchy)
		|			ELSE TRUE
		|		END
		|";
	QueryBuilderText = LocalizationEvents.ReplaceDescriptionLocalizationPrefix(QueryBuilderText);
	
	QueryBuilder = New QueryBuilder(QueryBuilderText);
	QueryBuilder.FillSettings();
	If TypeOf(Parameters) = Type("Structure") And Parameters.Filter.Property("CustomSearchFilter") Then
		ArrayOfFilters = CommonFunctionsServer.DeserializeXMLUseXDTO(Parameters.Filter.CustomSearchFilter);
		For Each Filter In ArrayOfFilters Do
			NewFilter = QueryBuilder.Filter.Add("Ref." + Filter.FieldName);
			NewFilter.Use = True;
			NewFilter.ComparisonType = Filter.ComparisonType;
			NewFilter.Value = Filter.Value;
		EndDo;
	EndIf;
	Query = QueryBuilder.GetQuery();
	
	Query.SetParameter("SearchString", Parameters.SearchString);
	
	AdditionalParameters = CommonFunctionsServer.DeserializeXMLUseXDTO(Parameters.Filter.AdditionalParameters);
	QueryParametersStr = New Structure("FilterByPartnerHierarchy,
			|CompaniesByPartnerHierarchy", False, New Array);
	FillPropertyValues(QueryParametersStr, AdditionalParameters);
	If QueryParametersStr.FilterByPartnerHierarchy Then
		CompaniesByPartnerHierarchy = Catalogs.Partners.GetCompaniesForPartner(AdditionalParameters.Partner);
		QueryParametersStr.Insert("CompaniesByPartnerHierarchy", CompaniesByPartnerHierarchy);
	EndIf;
	For Each QueryParameter In QueryParametersStr Do
		Query.SetParameter(QueryParameter.Key, QueryParameter.Value);
	EndDo;
	
	Return Query.Execute().Unload();
EndFunction

Function GetDefaultChoiseRef(Parameters) Export
	QueryTable = GetChoiseDataTable(New Structure("SearchString, Filter", "", Parameters));
	
	If QueryTable.Count() = 1 Then
		Return QueryTable[0].Ref;
	Else 
		If Parameters.Property("LegalName") Then
			Rows = QueryTable.FindRows(New Structure("Ref", Parameters.LegalName));
			If Rows.Count() = 0 Then
				Return PredefinedValue("Catalog.Companies.EmptyRef");
			Else
				Return Parameters.LegalName;
			EndIf;
		Else
			Return PredefinedValue("Catalog.Companies.EmptyRef");
		EndIf;
	EndIf;
EndFunction

Function GetLegalCurrencies(CompanyRef) Export
	Return GetCurrenciesByType(CompanyRef, Enums.CurrencyType.Legal);
EndFunction

Function GetReportingCurrencies(CompanyRef) Export
	Return GetCurrenciesByType(CompanyRef, Enums.CurrencyType.Reporting);
EndFunction

Function GetBudgetingCurrencies(CompanyRef) Export
	Return GetCurrenciesByType(CompanyRef, Enums.CurrencyType.Budgeting);
EndFunction

Function GetCurrenciesByType(CompanyRef, Type)
	Query = New Query();
	Query.Text = 
	"SELECT
	|	CompaniesCurrencies.MovementType AS CurrencyMovementType
	|FROM
	|	Catalog.Companies.Currencies AS CompaniesCurrencies
	|WHERE
	|	CompaniesCurrencies.Ref = &Ref
	|	AND CompaniesCurrencies.MovementType.Type = &Type";
	Query.SetParameter("Ref", CompanyRef);
	Query.SetParameter("Type", Type);
	QueryResult = Query.Execute();
	QuerySelection = QueryResult.Select();
	ArrayOfResults = New Array();
	While QuerySelection.Next() Do
		Result = New Structure();
		Result.Insert("CurrencyMovementType", QuerySelection.CurrencyMovementType);
		ArrayOfResults.Add(Result);
	EndDo;
	Return ArrayOfResults;
EndFunction
